# BuiltInFailures.ColorFillFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColorFillFailures Class
BuiltInFailures Class Members See Also
---
Failures about ColorFill.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ColorFillFailures
```

Visual Basic
---
```text
Public NotInheritable Class ColorFillFailures
```

Visual C++
---
```text
public ref class ColorFillFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ColorFillFailures
# See Also
BuiltInFailures..::..ColorFillFailures Members
Autodesk.Revit.DB Namespace